import React from "react";

export default function Rules() {
    return (
        <>
            <h2>Правила игры</h2>
            <p>
                Сначала компания решает, с кого начнётся игра.

                Первого спрашивают: «Правда или действие?». Если игрок отвечает: «Правда», то он должен будет
                правдиво ответить на вопрос, который ему будет задан. Если он выбирает действие, то должен будет
                выполнить задание (совершить задаваемое ему действие). После того как игрок ответил на вопрос или
                выполнил задание, то он спрашивает: «Правда или действие?» уже следующего. И так далее.

                В разных версиях игры вопрос или задание следующему игроку выдумывает либо предыдущий, либо вся
                компания. Все вопросы и задания могут быть также заготовлены заранее. Например, написаны на
                бумажках, которые раскладываются в две кучки (одна для вопросов и одна для заданий) и
                перемешиваются.

                Кроме того, компания должна решить, в каком порядке будет переходить ход. Например, следующего
                игрока будет выбирать предыдущий. Или ход будет переходить просто по кругу.

                Можно также договориться о дополнительных условиях, например, что нельзя выбирать правду (или
                действие) больше двух раз подряд. Или, наоборот, что каждый игрок может до трёх раз за игру
                отказаться выполнять задание.
            </p>
        </>
    )
}